�� ਪ੍ਰਕਿਰਿਆ ਪਾਸ ਨਹੀਂ ਕੀਤੀ ਕਿਉਂਕਿ
       ਅਸੀਂ URLs ਅਤੇ ਡੋਮੇਨਾਂ ਦਾ ਹੱਲ ਨਹੀਂ ਕਰ ਸਕੇ। ਤੁਸੀਂ
        $1 ਕਰ ਸਕਦੇ ਹੋ ਜਾਂ ਉਹਨਾਂ ਨੂੰ ਇੱਕ ਨਵੇਂ ਬ੍ਰਾਊਜ਼ਰ ਟੈਬ ਵਿੱਚ 
        $2 
        ਵੀ ਸਕਦੇ ਹੋ ਤਾਂ ਜੋ ਤੁਸੀਂ ਬਾਅਦ ਵਿੱਚ ਉਹਨਾਂ ਦਾ ਹਵਾਲਾ ਲੈ ਸਕੋ। ਇੰਟਰਾਨੈਟ ਸੇਵਾਵਾਂ 
        ਤਸਦੀਕ ਪ੍ਰਕਿਰਿਆ ਨੂੰ ਪਾਸ ਨਹੀਂ ਕਰਨਗੀਆਂ ਅਤੇ ਤੁਹਾਨੂੰ ਉਹਨਾਂ ਤਰੁੱਟੀਆਂ ਨੂੰ ਅਣਢਿੱਠਾ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ।$1 ਸਾਈਟਾਂ ਜੋੜਿਆਂ ਗਈਆਂ$1 ਸਾਂਝੀਆਂ ਕੀਤੀਆਂ ਕੁਕੀਜ਼ ਜੋੜੀਆਂ ਗਈਆਂਕੋਈ ਸਾਈਟ ਦਾਖਲੇ ਨਹੀਂਕੋਈ ਵੀ ਸਾਂਝੀ ਕੀਤੀ ਕੁਕੀਜ਼ ਦੀ ਐਂਟਰੀ ਨਹੀਂ ਹੈਕੋਈ ਅਯੋਗ ਸਾਈਟਾਂ ਨਹੀਂ ਲੱਭੀਆਂ ਹਨਕੋਈ ਅਵੈਧ ਸਾਂਝੀਆਂ ਕੀਤੀਆਂ ਕੁਕੀਜ਼ ਨਹੀਂ ਮਿਲਿਆਂਕੋਈ ਅਵੈਧ ਸਾਈਟਾਂ ਜਾਂ ਸਾਂਝੀਆਂ ਕੀਤੀਆਂ ਕੁਕੀਜ਼ ਨਹੀਂ ਮਿਲਿਆਂਕੋਈ ਸਾਈਟਾਂ ਜੋੜੀਆਂ ਨਹੀਂ ਗਈਆਂ ਸਨਕੋਈ ਵੀ ਸਾਂਝੀਆਂ ਕੀਤੀਆਂ ਕੁਕੀਜ਼ ਜੋੜੀਆਂ ਨਹੀਂ ਗਈਆਂ ਸਨ1 ਨਕਲੀ ਡੋਮੇਨ ਦੀ ਪਛਾਣ ਕੀਤੀ ਗਈ ਹੈ। ਇਹਨਾਂ ਨਕਲੀਆਂ ਨੂੰ ਸ਼ਾਮਲ ਕੀਤੇ ਬਿਨਾਂ “ਸ਼ਾਮਲ ਕਰੋ” ‘ਤੇ ਕਲਿੱਕ ਕਰੋ
         ਜਾਂ ਇਸ ਆਪਰੇਸ਼ਨ ਨੂੰ ਰੱਦ ਕਰਨ ਲਈ “ਰੱਦ ਕਰੋ” ‘ਤੇ ਕਲਿੱਕ ਕਰੋ।ਤੁਸੀਂ
      $1
        ਸਾਈਟ ਨੂੰ ਡਾਊਨਲੋਡ ਵੀ ਕਰ ਸਕਦੇ ਹੋ ਜਾਂ$2 ਨੂੰ ਇੱਕ ਨਵੇਂ ਬ੍ਰਾਊਜ਼ਰ ਵਿੱਚ ਖੋਲ ਸਕਦੇ ਹੋ
        ਤਾਂ ਜੋ ਤੁਸੀਂ ਬਾਅਦ ਵਿੱਚ ਇਸਦਾ ਹਵਾਲਾ ਲੈ ਸਕੋ।1 ਨਕਲੀ URL ਦੀ ਪਛਾਣ ਕੀਤੀ ਗਈ ਹੈ। ਇਹਨਾਂ ਨਕਲੀਆਂ ਨੂੰ ਸ਼ਾਮਲ ਕੀਤੇ ਬਿਨਾਂ “ਸ਼ਾਮਲ ਕਰੋ” ‘ਤੇ ਕਲਿੱਕ ਕਰੋ
         ਜਾਂ ਇਸ ਆਪਰੇਸ਼ਨ ਨੂੰ ਰੱਦ ਕਰਨ ਲਈ “ਰੱਦ ਕਰੋ” ‘ਤੇ ਕਲਿੱਕ ਕਰੋ।ਤੁਸੀਂ
      $1
        ਸਾਈਟ ਨੂੰ ਡਾਊਨਲੋਡ ਵੀ ਕਰ ਸਕਦੇ ਹੋ ਜਾਂ$2 ਨੂੰ ਇੱਕ ਨਵੇਂ ਬ੍ਰਾਊਜ਼ਰ ਵਿੱਚ ਖੋਲ ਸਕਦੇ ਹੋ
        ਤਾਂ ਜੋ ਤੁਸੀਂ ਬਾਅਦ ਵਿੱਚ ਇਸਦਾ ਹਵਾਲਾ ਲੈ ਸਕੋ।1 ਅਵੈਧ ਸਾਂਝੀ ਕੀਤੀ ਕੁਕੀ ਨੇ ਤਸਦੀਕ ਪ੍ਰਕਿਰਿਆ ਨੂੰ ਪਾਸ ਨਹੀਂ ਕੀਤਾ ਕਿਉਂਕਿ ਅਸੀਂ ਡੋਮੇਨ ਦਾ ਹੱਲ ਨਹੀਂ ਕਰ ਸਕੇ।
        ਤੁਸੀਂ ਸਾਂਝੀ ਕੀਤੀ ਕੁਕੀ ਨੂੰ$1 ਕਰ ਸਕਦੇ ਹੋ
        ਜਾਂ ਇੱਕ ਨਵੇਂ ਬ੍ਰਾਊਜ਼ਰ ਟੈਬ ਵਿੱਚ ਇਸ ਨੂੰ $2
        ਖੋਲ੍ਹ ਵੀ ਸਕਦੇ ਹੋ ਤਾਂ ਜੋ ਇਸਦਾ ਦੁਬਾਰਾ ਤੋਂ ਹਵਾਲਾ ਲੈ ਸਕੋ। ਅੰਦਰੂਨੀ ਇੰਟਰਾਨੈਟ ਸਾਈਟਾਂ
        ਤਸਦੀਕ ਪ੍ਰਕਿਰਿਆ ਨੂੰ ਪਾਸ ਨਹੀਂ ਕਰਨਗੀਆਂ ਅਤੇ ਤੁਹਾਨੂੰ ਉਹਨਾਂ ਤਰੁੱਟੀਆਂ ਨੂੰ ਅਣਢਿੱਠਾ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ।1 ਅਵੈਧ ਸਾਈਟ ਨੇ ਤਸਦੀਕ ਪ੍ਰਕਿਰਿਆ ਨੂੰ ਪਾਸ ਨਹੀਂ ਕੀਤਾ ਕਿਉਂਕਿ ਅਸੀਂ URL ਦਾ ਹੱਲ ਨਹੀਂ ਕਰ ਸਕੇ।
        ਤੁਸੀਂ $1 ਨੂੰ ਡਾਊਨਲੋਡ ਕਰ ਸਕਦੇ ਹੋ
        ਜਾਂ $2 ਇੱਕ ਨਵੇਂ
        ਬ੍ਰਾਊਜ਼ਰ ਟੈਬ ਵਿੱਚ ਇਸ ਨੂੰ ਖੋਲ੍ਹ ਸਕਦੇ ਹੋ ਤਾਂ ਜੋ ਇਸਦਾ ਦੁਬਾਰਾ ਤੋਂ ਹਵਾਲਾ ਲੈ ਸਕੋ। ਅੰਦਰੂਨੀ ਇੰਟਰਾਨੈਟ ਸਾਈਟਾਂ
        ਤਸਦੀਕ ਪ੍ਰਕਿਰਿਆ ਨੂੰ ਪਾਸ ਨਹੀਂ ਕਰਨਗੀਆਂ ਅਤੇ ਤੁਹਾਨੂੰ ਉਹਨਾਂ ਤਰੁੱਟੀਆਂ ਨੂੰ ਅਣਢਿੱਠਾ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ।$1 ਸਾਈਟ ਜੋੜੀ ਗਈ$1 ਸਾਂਝੀ ਕੀਤੀ ਕੁਕੀ ਜੋੜੀ ਗਈਫਾਈਲ ਪਾਰਸ ਕਰਨ ਸਮੇਂ ਕੁਝ ਤਰੁੱਟੀ ਆਈ ਹੈ। ਕਿਰਪਾ ਕਰਕੇ ਫਾਈਲ ਦੇ xml ਫਾਰਮੈਟ ਦੀ ਜਾਂਚ ਕਰੋ।XML ਪੂਰਵਦਰਸ਼ਨURL ਮੁਤਾਬਕ ਸਾਈਟਸ ਨੂੰ ਫਿਲਟਰ ਕਰੋਸਾਂਝੀ ਕੀਤੀ ਕੁਕੀ ਦਾ ਸੰਪਾਦਨ ਕੀਤਾ ਗਿਆ।ਦੋਵੇਂMSEdgeਸਾਈਟ ਸੂਚੀ ਤਾਲਿਕਾਸਾਂਝੀਆਂ ਕੀਤੀਆਂ ਕੁਕੀਜ਼ਏਨਟਰਪ੍ਰਾਈਜ਼ ਸਾਈਟ ਸੂਚੀ ਪ੍ਰਬੰਧਕਏਨਟਰਪ੍ਰਾਈਜ਼ ਸਾਈਟ ਸੂਚੀ ਪ੍ਰਬੰਧਕ (ਪੂਰਵਦਰਸ਼ਨ)ਸਾਈਟ ਸੂਚੀ ਨੂੰ ਪ੍ਰਮਾਣਿਤ ਕਰੋਸੰਸਕਰਣ ਨੰਬਰ:ਫਾਈਲ ਵਿੱਚ ਕੁਝ ਜਾਣਕਾਰੀ ਲੁਪਤ ਹੈ। ਯਕੀਨੀ ਬਣਾਓ ਕਿ ਤੁਹਾਡੇ ਕੋਲ ਹਰ ਸਾਈਟ ਦੇ ਸਾਰੇ ਲੋੜੀਂਦੇ ਗੁਣ ਹਨ।ਫਾਈਲ ਵਿੱਚ ਕੁਝ ਜਾਣਕਾਰੀ ਲੁਪਤ ਹੈ। ਯਕੀਨੀ ਬਣਾਓ ਕਿ ਤੁਹਾਡੇ ਕੋਲ ਹਰੇਕ ਸਾਈਟ ਅਤੇ ਹਰੇਕ ਸਾਂਝੀ ਕੀਤੀ ਕੁਕੀ ਦੇ ਸਾਰੇ ਲੋੜੀਂਦੇ ਗੁਣ ਹਨ।ਇਸ ਫਾਈਲ ਵਿੱਚ ਮੌਜੂਦ ਕੁਝ ਜਾਣਕਾਰੀ ਗਲਤ ਹੈ। ਕਿਰਪਾ ਕਰਕੇ "open-in" ਅਤੇ "compat-mode" ਟੈਗਾਂ ਦੇ ਮੁੱਲ (ਕੇਸ ਸੰਵੇਦੀ) ਦੀ ਚੰਗੀ ਤਰ੍ਹਾਂ ਜਾਂਚ ਕਰੋ।ਲਿਖਤ ਪੱਤਰ ਵਿੱਚ ਕੁਝ ਜਾਣਕਾਰੀ ਗਲਤ ਹੈ। ਕਿਰਪਾ ਕਰਕੇ "ਓਪਨ-ਇਨ" ਅਤੇ "ਕੰਪੈਟ-ਮੋਡ" ਟੈਗਸ ਦੇ ਮੁੱਲ (ਕੇਸ ਸੰਵੇਦੀ) ਦੀ ਦੋ ਵਾਰ ਜਾਂਚ ਕਰੋ, ਅਤੇ ਇਹ ਕਿ ਤੁਸੀਂ "ਹੋਸਟ" ਅਤੇ "ਡੋਮੇਨ" ਵਿਸ਼ੇਸ਼ਤਾਵਾਂ ਨੂੰ ਇੱਕੋ ਤੱਤ 'ਤੇ ਸੈਟ ਨਹੀਂ ਕੀਤਾ ਹੈ। ਨੋਟ: ਤੁਹਾਡੇ ਕੋਲ "ਹੋਸਟ" ਐਟ੍ਰਰੀਬਿਯੂਟ 'ਤੇ ਪੰਗਤੀ-ਵਿੱਥ ਮਿਆਦ (.) ਨਹੀਂ ਹੋ ਸਕਦੀ ਹੈ।ਤੁਹਾਡੇ ਤਤਕਰੇ ਦੇ ਨਾਲ-ਨਾਲ ਆਪਣੇ ਮੇਲ ਨੂੰ ਦੇਖਣ ਲਈ ਸਾਈਨ-ਇਨ ਕਰੋMicrosoft Edge ਸਾਈਡਬਾਰ ਵਿੱਚ ਬਿਲਟ-ਇਨ Outlook ਏਕੀਕਰਨ ਵਾਲਾ ਇੱਕੋ-ਇੱਕ ਬ੍ਰਾਉਜ਼ਰ ਹੈ, ਇਸ ਲਈ ਤੁਸੀਂ ਐਪਾਂ ਵਿਚਕਾਰ ਸਵਿੱਚ ਕੀਤੇ ਬਿਨਾਂ ਆਪਣੀ ਈਮੇਲ ਨੂੰ ਦੇਖ ਕੇ ਵੈੱਬ ਨੂੰ ਬ੍ਰਾਉਜ਼ ਕਰ ਸਕਦੇ ਹੋ।ਸਾਈਨ-ਇਨ ਕਰੋ ਅਤੇ ਸਿੰਕ ਕਰੋMicrosoft Edge ਵਿੱਚ Outlook ਤੋਂ ਲਿੰਕਾਂ ਨੂੰ ਖੋਲ੍ਹ ਕੇ ਆਪਣੇ ਕੰਮ ਨੂੰ ਵਧਾਓਇਹ ਸੈਟਿੰਗ ਇਸ ਨੂੰ ਪ੍ਰਭਾਵਿਤ ਕਰੇਗੀ ਕਿ ਕਿਵੇਂ ਵੈਬ ਲਿੰਕਸ ਨੂੰ Outlook ਅਤੇ Teams ਵਿੱਚ ਕਿਵੇਂ ਖੋਲ੍ਹਿਆ ਜਾਂਦਾ ਹੈ। ਤੁਸੀਂ ਇਸ ਸੈਟਿੰਗ ਨੂੰ ਕਿਸੇ ਵੀ ਸਮੇਂ Outlook ਜਾਂ Teams ਦੇ ਅੰਦਰ ਬਦਲ ਸਕਦੇ ਹੋ।Microsoft 365-ਅਨੁਕੂਲਿਤ ਬ੍ਰਾਉਜ਼ਰ (Microsoft Edge) ਦੀ ਵਰਤੋਂ ਕਰੋਸਿਸਟਮ ਡਿਫੌਲਟ ਦੀ ਵਰਤੋਂ ਕਰੋਸਿਸਟਮ ਡਿਫੌਲਟ ($1) ਦੀ ਵਰਤੋਂ ਕਰੋMicrosoft 365 ਐਪਸ ਵਿੱਚ ਵੈੱਬ ਲਿੰਕ ਕਿਵੇਂ ਖੋਲ੍ਹੇ ਜਾਂਦੇ ਹਨ ਇਸ ਨੂੰ ਬਦਲੋਸਿੱਖੋ ਕਿਵੇਂਵੈੱਬ ਦੇ ਨਾਲ-ਨਾਲ ਆਪਣੀ ਈਮੇਲ ਦੇਖਣ ਲਈ ਸਾਈਨ ਇਨ ਕਰੋਜਦੋਂ ਤੁਸੀਂ Outlook ਤੋਂ ਲਿੰਕ ਖੋਲ੍ਹਦੇ ਹੋ, ਤਾਂ ਅਸੀਂ ਤੁਹਾਨੂੰ ਉਸ ਈਮੇਲ ਨੂੰ ਦਿਖਾਵਾਂਗੇ ਜਦੋਂ ਤੁਸੀਂ Microsoft Edge ਵਿੱਚ ਸਾਈਨ ਇਨ ਕੀਤਾ ਹੈ। $1ਸਾਈਨ ਇਨ ਕਰਕੇ, ਤੁਹਾਡੇ ਮਨਪਸੰਦ, ਪਾਸਵਰਡ, ਅਤੇ ਇਤਿਹਾਸ ਨੂੰ ਤੁਹਾਡੇ ਸਾਰੇ ਡਿਵਾਈਸਿਸ 'ਤੇ ਸਿੰਕ ਕੀਤਾ ਜਾਵੇਗਾ। $1ਸਾਈਨ ਇਨ ਕਰੋ ਅਤੇ ਸਿੰਕ ਕਰੋOutlook($1) ਨਾਲ ਸਾਈਨ ਇਨ ਕਰੋ ਅਤੇ ਸਿੰਕ ਕਰੋਵੈੱਬ ਦੇ ਨਾਲ-ਨਾਲ ਆਪਣੀ Teams ਚੈਟ ਨੂੰ ਦੇਖਣ ਲਈ ਸਾਈਨ ਇਨ ਕਰੋਜਦੋਂ ਤੁਸੀਂ Teams ਤੋਂ ਇੱਕ ਲਿੰਕ ਖੋਲ੍ਹਦੇ ਹੋ ਅਤੇ ਤੁਸੀਂ Microsoft Edge ਵਿੱਚ ਸਾਈਨ ਇਨ ਕਰਦੇ ਹੋ ਤਾਂ ਅਸੀਂ ਤੁਹਾਨੂੰ ਉਹ ਚੈਟ ਦਿਖਾਵਾਂਗੇ ਜੋ ਤੁਸੀਂ ਇੱਥੋਂ ਆਏ ਹੋ। $1Teamsਵੈੱਬ ਦੇ ਨਾਲ-ਨਾਲ ਆਪਣੀ ਚੈਟ ਦਾ ਸੰਦਰਭ ਦੇਖਣ ਲਈ ਸਾਈਨ ਇਨ ਕਰੋਜਦੋਂ ਤੁਸੀਂ Skype ਤੋਂ ਇੱਕ ਲਿੰਕ ਖੋਲ੍ਹਦੇ ਹੋ ਅਤੇ ਤੁਸੀਂ Microsoft Edge ਵਿੱਚ ਸਾਈਨ ਇਨ ਕਰਦੇ ਹੋ, ਤਾਂ ਅਸੀਂ ਤੁਹਾਨੂੰ ਇੱਥੋਂ ਆਇਆ ਸੁਨੇਹਾ ਦਿਖਾਵਾਂਗੇ। $1SkypeMicrosoft ਸਹਾਇਤਾMicrosoft Edge ਸਮਰਥਨ ਸੂਚੀਆਂMicrosoft Edge:ਚੱਲਣਯੋਗ ਮਾਰਗ:ਔਪਰੇਟਿੰਗ ਸਿਸਟਮ:ਸੁਧਾਈ:ਉਪਭੋਗਤਾ ਏਜੰਟ:ਆਦੇਸ਼ ਪੰਗਤੀ:ਪ੍ਰੋਫਾਈਲ ਰਸਤਾ:ਅੰਤਰ:Javascript:ਚੈਨਲ:ਗਾਹਕ Id:ਇਹ ਪੰਨਾ ਤੁਹਾਡੀ ਮਸ਼ੀਨ ਵਿੱਚ ਇੰਸਟਾਲ ਕੀਤੇ ਐਕਸਟੈਂਸ਼ਨਾਂ ਨੂੰ ਵਿਖਾਉਂਦਾ ਹੈਸਮਰਥਨ ਦੀ ਖੋਜ ਕਰੋਨੀਤੀ ਦਾ ਨਾਮਨੀਤੀ ਵੈਲਿਊਸਮੂਹ ਨੀਤੀਸਮੂਹ ਨੀਤੀ ਜਾਣਕਾਰੀਇਹ ਨੀਤੀਆਂ ਇਸ ਮਸ਼ੀਨ ਵਿੱਚ IT ਪ੍ਰਬੰਧਕ ਦੁਆਰਾ ਸੈੱਟ ਕੀਤੀਆਂ ਗਈਆਂ ਹਨ।
        ਗਰੁੱਪ ਨੀਤੀ ਰਾਹੀਂ ਇਹਨਾਂ ਨੂੰ ਕੰਫਿਗਰ ਕੀਤਾ ਗਿਆ ਹੈ।ਪਰਿਵਾਰ ਸੁਰੱਖਿਆ ਅੰਦਰੂਨੀJSON ਵਜੋਂ ਡਾਉਨਲੋਡ ਕਰੋਆਪਣੇ ਡੇਟਾ ਨੂੰ ਸਾਫ਼ ਕਰਨ ਤੋਂ ਬਾਅਦ, ਤੁਹਾਡਾ ਬ੍ਰਾਊਜ਼ਿੰਗ ਡੇਟਾ ਤੁਹਾਡੇ ਖਾਤਿਆਂ ਦੀਆਂ ਸੈਟਿੰਗਾਂ ਦੇ ਅਧਾਰ ਤੇ ਤੁਹਾਡੀ ਪਰਿਵਾਰਕ ਗਤੀਵਿਧੀ ਰਿਪੋਰਟਾਂ ਵਿੱਚ ਅੱਜੇ ਵੀ ਵਿਖਾਈ ਦੇ ਸਕਦਾ ਹੈ।ਅਨੁਮਤੀ ਲਈ ਪੁੱਛੋਇਸ ਸੁਨੇਹੇ ਨੂੰ ਖਾਰਜ ਕਰੋ$1 ਮੇਨੂਇੱਕ ਤੋਂ ਵੱਧ ਟੈਬਸ ਵਾਲੀ ਵਿੰਡੋ ਨੂੰ ਬ�igned to this menu are handled.
			api.each( function( otherSetting ) {
				if ( ! otherSetting._navMenuThemeLocation ) {
					return;
				}
				if ( setting._navMenuId === otherSetting() ) {
					self.handleUnplacedNavMenuInstances( {
						theme_location: otherSetting._navMenuThemeLocation
					} );
				}
			} );
		};

		/**
		 * Handle change for nav_menu_item[] setting for nav menu instances lacking partials.
		 *
		 * @since 4.5.0
		 *
		 * @param {Object} newItem New value for nav_menu_item[] setting.
		 * @param {Object} oldItem Old value for nav_menu_item[] setting.
		 * @this {wp.customize.Value}
		 */
		self.onChangeNavMenuItemSetting = function( newItem, oldItem ) {
			var item = newItem || oldItem, navMenuSetting;
			navMenuSetting = api( 'nav_menu[' + String( item.nav_menu_term_id ) + ']' );
			if ( navMenuSetting ) {
				self.onChangeNavMenuSetting.call( navMenuSetting );
			}
		};

		/**
		 * Handle change for nav_menu_locations[] setting for nav menu instances lacking partials.
		 *
		 * @since 4.5.0
		 *
		 * @this {wp.customize.Value}
		 */
		self.onChangeNavMenuLocationsSetting = function() {
			var setting = this, hasNavMenuInstance;
			self.handleUnplacedNavMenuInstances( {
				theme_location: setting._navMenuThemeLocation
			} );

			// If there are no wp_nav_menu() instances that refer to the theme location, do full refresh.
			hasNavMenuInstance = !! _.findWhere( _.values( self.data.navMenuInstanceArgs ), {
				theme_location: setting._navMenuThemeLocation
			} );
			if ( ! hasNavMenuInstance ) {
				api.selectiveRefresh.requestFullRefresh();
			}
		};
	}

	/**
	 * Connect nav menu items with their corresponding controls in the pane.
	 *
	 * Setup shift-click on nav menu items which are more granular than the nav menu partial itself.
	 * Also this applies even if a nav menu is not partial-refreshable.
	 *
	 * @since 4.5.0
	 */
	self.highlightControls = function() {
		var selector = '.menu-item';

		// Skip adding highlights if not in the customizer preview iframe.
		if ( ! api.settings.channel ) {
			return;
		}

		// Focus on the menu item control when shift+clicking the menu item.
		$( document ).on( 'click', selector, function( e ) {
			var navMenuItemParts;
			if ( ! e.shiftKey ) {
				return;
			}

			navMenuItemParts = $( this ).attr( 'class' ).match( /(?:^|\s)menu-item-(-?\d+)(?:\s|$)/ );
			if ( navMenuItemParts ) {
				e.preventDefault();
				e.stopPropagation(); // Make sure a sub-nav menu item will get focused instead of parent items.
				api.preview.send( 'focus-nav-menu-item-control', parseInt( navMenuItemParts[1], 10 ) );
			}
		});
	};

	api.bind( 'preview-ready', function() {
		self.init();
	} );

	return self;

}( jQuery, _, wp, wp.customize ) );
